app/views/feed/index.html.erb

                <%= user_avatar(gossip.user, size: 20) %>
                Par <%= link_to gossip.user.first_name, user_path(gossip.user), class: "text-decoration-none text-muted" %> — <%= gossip.created_at.strftime("%d/%m/%Y") %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 12 ORDER BY "users"."id" ASC LIMIT 1