app/views/devise/registrations/new.html.erb

          <%= f.label :city_id, "Ville", class: "form-label" %>
          <%= f.collection_select :city_id, City.order(:name), :id, :name, { include_blank: "— Choisir une ville —" }, { class: "form-select" } %>
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC