app/views/notifications/index.html.erb

                <% if notification.notifiable.is_a?(Comment) %>
                  <strong><%= notification.notifiable.user.first_name %></strong> a commente votre potin.
                <% end %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 ORDER BY "users"."id" ASC LIMIT 1