app/views/users/show.html.erb

SELECT 1 AS one FROM "gossips" WHERE "gossips"."user_id" = 11 LIMIT 1
---

  <% if @user.gossips.any? %>