app/views/users/show.html.erb


  <% if @user.gossips.any? %>
    <div class="row mt-3">
      <% @user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = 12
SELECT 1 AS one FROM "gossips" WHERE "gossips"."user_id" = 13 LIMIT 1
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = 13