app/views/gossips/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
SELECT 1 AS one FROM "tags" INNER JOIN "join_table_gossip_tags" ON "tags"."id" = "join_table_gossip_tags"."tag_id" WHERE "join_table_gossip_tags"."gossip_id" = 21 LIMIT 1
---
            <h5 class="card-title"><%= gossip.title %></h5>
            <p class="card-text text-muted">Par <%= gossip.user.first_name %></p>
            <p class="card-text small text-muted"><%= gossip.comments.size %> commentaire<%= "s" if gossip.comments.size != 1 %> — <%= gossip.likes.size %> like<%= "s" if gossip.likes.size != 1 %></p>
            <% if gossip.tags.any? %>