app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
---
    <%= user_avatar(@gossip.user, size: 28) %>
    Par <%= link_to @gossip.user.first_name, user_path(@gossip.user) %>

SELECT 1 AS one FROM "tags" INNER JOIN "join_table_gossip_tags" ON "tags"."id" = "join_table_gossip_tags"."tag_id" WHERE "join_table_gossip_tags"."gossip_id" = 24 LIMIT 1
---
      </p>
      <% if @gossip.tags.any? %>

SELECT "users".* FROM "users" WHERE "users"."id" = 12 LIMIT 1
---
              <%= user_avatar(comment.user, size: 22) %>
              <strong><%= link_to comment.user.first_name, user_path(comment.user) %></strong>