app/controllers/cities_controller.rb

  def show
    @city = City.find(params[:id])
    @gossips = Gossip.joins(:user).includes(:likes).where(users: { city_id: @city.id }).order(created_at: :desc)
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = 36 LIMIT 1
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "users"."id" = "gossips"."user_id" WHERE "users"."city_id" = 36 ORDER BY "gossips"."created_at" DESC