app/controllers/comments_controller.rb

  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = @gossip.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 21 LIMIT 1
INSERT INTO "comments" ("content", "user_id", "commentable_type", "commentable_id", "created_at", "updated_at") VALUES ('avoue j''ai raison ?', 11, 'Gossip', 21, '2026-02-17 01:08:53.841994', '2026-02-17 01:08:53.841994') RETURNING "id"

  def destroy
    gossip = gossip_for_comment(@comment)
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = 21