app/controllers/conversations_controller.rb

  def new
    @message = PrivateMessage.new
    @recipient = User.find_by(id: params[:recipient_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1