app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips" ORDER BY "gossips"."created_at" DESC
---
  def index
    @pagy, @gossips = pagy(
      Gossip.includes(:user, :tags, :comments, :likes).order(created_at: :desc)
    )

SELECT "tags".* FROM "tags" ORDER BY "tags"."title" ASC
---
  def new
    @gossip = Gossip.new
    @tags = Tag.order(:title)

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('lkjdflhlsfkqjf', 'sdfjlljdmqlksjlkjfljfslmqjfmhfkqùdjfqfj', 12, '2026-02-17 09:49:02.982306', '2026-02-17 09:49:02.982306') RETURNING "id"
---
  def create
    @gossip = current_user.gossips.build(gossip_params)

    if @gossip.save

SELECT "tags".* FROM "tags" ORDER BY "tags"."title" ASC
---
  def edit
    @tags = Tag.order(:title)

UPDATE "gossips" SET "updated_at" = '2026-02-17 14:52:11.920741' WHERE "gossips"."id" = 24
---
  def update
    if @gossip.update(gossip_params)

DELETE FROM "gossips" WHERE "gossips"."id" = 22
---
  def destroy
    @gossip.destroy

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 22 LIMIT 1
---
  def set_gossip
    @gossip = Gossip.find(params[:id])