app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES (11, 'Gossip', 21, '2026-02-17 01:08:34.817681', '2026-02-17 01:08:34.817681') RETURNING "id"
---
  def create
    likeable = find_likeable
    unless likeable
      redirect_back fallback_location: root_path, alert: "Action impossible."
      return
    end
    like = current_user.likes.build(likeable: likeable)
    if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 11 AND "likes"."id" = 22 LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = 22
---
  def destroy
    like = current_user.likes.find(params[:id])
    like.destroy