app/controllers/notifications_controller.rb

  def index
    @notifications = current_user.notifications.recent.includes(:notifiable).limit(50)
    current_user.notifications.unread.update_all(read: true)
---
UPDATE "notifications" SET "read" = TRUE WHERE "notifications"."user_id" = 11 AND "notifications"."read" = FALSE