app/views/cities/show.html.erb

              <h5 class="card-title"><%= gossip.title %></h5>
              <p class="card-text text-muted">Par <%= gossip.user.first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1