app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 13 AND "notifications"."read" = FALSE
---
              <li class="nav-item">
                <% unread_count = current_user.notifications.unread.count %>