app/views/layouts/application.html.erb

              <li class="nav-item">
                <% unread_count = current_user.notifications.unread.count %>
---
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 11 AND "notifications"."read" = FALSE